/**
 * Пакет, содержащий модели данных для работы с космическими десантниками.
 * <p>
 * Основные классы:
 * <ul>
 *   <li>{@link model.SpaceMarine} — класс, представляющий космического десантника.</li>
 *   <li>{@link model.Coordinates} — класс, представляющий координаты десантника.</li>
 *   <li>{@link model.Chapter} — класс, представляющий главу десантника.</li>
 *   <li>{@link model.Weapon} — перечисление, представляющее типы оружия.</li>
 *   <li>{@link model.MeleeWeapon} — перечисление, представляющее типы оружия ближнего боя.</li>
 * </ul>
 *
 * @author ISyntax
 * @version 1.0
 */
package model;